ozbapp/app/controllers/darlehensverlauf_controller.rb

  def new
    @anzeigen = params[:anzeigen]
    @summeDerPunkte = 0
    @summeSoll = 0
    @summeHaben = 0
    @differenzSollHaben
    @tagesSaldoAltHaben = 0
    @notice = Array.new
    @errors  = Array.new
    @Buchung = nil


    #prüfen ob das anfangsdatum in richtigem format angegeben wurde
    if (params[:vonDatum] =~ /[0-9]{2}.[0-9]{2}.[0-9]{4}/)
      @vonDatum = params[:vonDatum]
    end

    #prüfen ob das enddatum in richtigem format angegeben wurde
    if (params[:vonDatum] =~ /[0-9]{2}.[0-9]{2}.[0-9]{4}/)
      @bisDatum = params[:bisDatum]
    end


    #wurde der anzeigen button noch nicht betätigt. erster klick auf einen kontolink
    if @anzeigen.to_s.empty?
      @Buchung = Buchung.where("KtoNr = ?", params[:KtoNr]).order("Belegdatum Desc, SollBetrag ASC, Typ DESC, PSaldoAcc DESC").limit(10).reverse
      #prüfung ob es überhaupt buchungen gibt
      if !@Buchung.empty?

        if params[:EEoZEkonto] == "EE"
          @bankId = EeKonto.where("KtoNr = ?", params[:KtoNr]).first.bankId
---
SELECT `buchung`.* FROM `buchung` WHERE (KtoNr = '70013' AND Belegdatum <= '2013-02-01' AND Typ = 'w') ORDER BY Belegdatum DESC, HabenBetrag DESC
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `buchung` WHERE (KtoNr = '70013' AND Belegdatum < '2012-10-16' AND Typ = 'w') LIMIT 1) subquery_for_count
SELECT `buchung`.* FROM `buchung` WHERE (KtoNr = '70013' AND Belegdatum <= '2013-02-01' AND Typ = 'w') ORDER BY Belegdatum DESC, HabenBetrag DESC LIMIT 1
SELECT `eekonto`.* FROM `eekonto` WHERE (KtoNr = '70013') LIMIT 1

          @bankId = EeKonto.where("KtoNr = ?", @EeKtoNrZumZeKto).first.bankId
        end

        @pnrDesInhabers = Bankverbindung.where("ID = ?", @bankId).first.pnr
        @personZurPnr = Person.where("Pnr = ?", @pnrDesInhabers).first
---
SELECT `bankverbindung`.* FROM `bankverbindung` WHERE (ID = 9) LIMIT 1
SELECT `person`.* FROM `person` WHERE (Pnr = 13) LIMIT 1

         @tagesSaldoAltHaben = @vorBuchung.first.WSaldoAcc
         @tagesSaldoAltPunkte = @vorBuchung.first.Punkte

         @kklVerlaufKlasse = KklVerlauf.where("KtoNr = ?", params[:KtoNr]).order("KKLAbDatum DESC").limit(1).first.KKL
---
SELECT `kklverlauf`.* FROM `kklverlauf` WHERE (KtoNr = '70013') ORDER BY KKLAbDatum DESC LIMIT 1