ozbapp/app/controllers/ozb_person_controller.rb

  def detailsOZBPerson
      @OZBPerson = OZBPerson.find(current_OZBPerson.Mnr)
      @Person    = Person.get(@OZBPerson.Mnr)
      @Adresse   = Adresse.get(@Person.Pnr)
      @Telefon   = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "tel"})
      @Fax       = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "fax"})
      @Mobil     = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "mob"})

      @Tel       = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr}, :order => "LfdNr ASC")

      @Rollen  = @@Rollen
      @Rollen2 = @@Rollen2

      case @Person.Rolle
      when "M"
      @Mitglied        = Mitglied.get(@OZBPerson.Mnr)
      when "F"
      @Foerdermitglied = Foerdermitglied.get(@Person.Pnr)
      when "P"
      @Partner         = Partner.get(@OZBPerson.Mnr)
      @PartnerPerson   = Person.get(@Partner.MnrO)
      when "G"
      @Gesellschafter  = Gesellschafter.get(@OZBPerson.Mnr)
---
SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `adresse`.* FROM `adresse` WHERE `adresse`.`Pnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:27') AND (GueltigBis > '2013-03-18 14:30:27') LIMIT 1
SELECT `person`.* FROM `person` WHERE `person`.`Pnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:27') AND (GueltigBis > '2013-03-18 14:30:27') LIMIT 1
SELECT `telefon`.* FROM `telefon` WHERE `telefon`.`Pnr` = 13 AND `telefon`.`TelefonTyp` = 'tel'
SELECT `gesellschafter`.* FROM `gesellschafter` WHERE `gesellschafter`.`Mnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:27') AND (GueltigBis > '2013-03-18 14:30:27') LIMIT 1

  def editPersonaldaten
      if is_allowed(current_OZBPerson, 3)
        @OZBPerson = OZBPerson.find(current_OZBPerson.Mnr)
---
SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1

  def editKontaktdaten
      @OZBPerson = OZBPerson.find(current_OZBPerson.Mnr)
      @Person    = Person.get(@OZBPerson.Mnr)
      @Adresse   = Adresse.get(@Person.Pnr)
      @Telefon   = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "tel"})
---
SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `adresse`.* FROM `adresse` WHERE `adresse`.`Pnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:45') AND (GueltigBis > '2013-03-18 14:30:45') LIMIT 1
SELECT `person`.* FROM `person` WHERE `person`.`Pnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:45') AND (GueltigBis > '2013-03-18 14:30:45') LIMIT 1
SELECT `telefon`.* FROM `telefon` WHERE `telefon`.`Pnr` = 13 AND `telefon`.`TelefonTyp` = 'tel'

  def editRolle
      if is_allowed(current_OZBPerson, 20)
        @OZBPerson = OZBPerson.find(current_OZBPerson.Mnr)
        @Person    = Person.get(@OZBPerson.Mnr)

        @DistinctPersonen = Person.find(:all, :select => "DISTINCT Pnr, Name, Vorname")
        @Rollen = @@Rollen
        @Rolle2 = @@Rollen2

        @Student         = Student.new
        @Foerdermitglied = Foerdermitglied.new
        @Gesellschafter  = Gesellschafter.new
        @Partner         = Partner.new
        @Mitglied        = Mitglied.new

        case @Person.Rolle
        when "M"
        @Mitglied        = Mitglied.get(@OZBPerson.Mnr)
        when "F"
        @Foerdermitglied = Foerdermitglied.get(@Person.Pnr)
        when "P"
        @Partner         = Partner.get(@OZBPerson.Mnr)
        @PartnerPerson   = Person.get(@Partner.MnrO)
        when "G"
        @Gesellschafter  = Gesellschafter.get(@OZBPerson.Mnr)
---
SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `person`.* FROM `person` WHERE `person`.`Pnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:47') AND (GueltigBis > '2013-03-18 14:30:47') LIMIT 1
SELECT `gesellschafter`.* FROM `gesellschafter` WHERE `gesellschafter`.`Mnr` = 13 AND (GueltigVon <= '2013-03-18 14:30:47') AND (GueltigBis > '2013-03-18 14:30:47') LIMIT 1