ozbapp/app/controllers/sonderberechtigung_controller.rb

SELECT `geschaeftsprozess`.* FROM `geschaeftsprozess` WHERE `geschaeftsprozess`.`ID` = 1 LIMIT 1
---
  def listGeschaeftsprozesse
    @Geschaeftsprozesse = Geschaeftsprozess.find(:all)

SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `sonderberechtigung`.* FROM `sonderberechtigung` WHERE `sonderberechtigung`.`Mnr` = 13 AND `sonderberechtigung`.`Berechtigung` = 'IT' LIMIT 1
INSERT INTO `sonderberechtigung` (`Berechtigung`, `Email`, `Mnr`, `SachPnr`) VALUES ('IT', 'wolfgang.e.seidel@t-online.de', 5, 13)
---
  def createBerechtigungRollen
    @errors = Array.new
    begin
      #Beginne Transaktion
      ActiveRecord::Base.transaction do

        @OZBPerson = OZBPerson.find(params[:mnr])
        @Person = Person.get(@OZBPerson.Mnr)



        # Keine Berechtigung dieser Art gefunden
        if    !Sonderberechtigung.find(:first, :conditions => {:Mnr =>params[:mnr], :Berechtigung => params[:berechtigung]}) &&
              !Sonderberechtigung.find(:first, :conditions => {:Mnr =>params[:mnr], :Berechtigung => 'IT'}) &&
              ( !params[:email].blank? || !@Person.EMail.blank? ) then
          @bereitsVorhanden = false

          # Berechtigung erstellen und validieren

          if params[:email].blank? && !@Person.EMail.blank? then
            @new_Sonderberechtigung = Sonderberechtigung.new(:Mnr =>params[:mnr], :EMail => @Person.EMail, :Berechtigung => params[:berechtigung], :SachPnr => current_user.Mnr)
          else
            @new_Sonderberechtigung = Sonderberechtigung.new(:Mnr =>params[:mnr], :EMail => params[:email], :Berechtigung => params[:berechtigung], :SachPnr => current_user.Mnr)
          end

          #Fehler aufgetreten?
          if !@new_Sonderberechtigung.valid? then
            @errors.push(@new_Sonderberechtigung.errors)

SELECT `sonderberechtigung`.* FROM `sonderberechtigung`
SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
---
  def editRollen
    @falseTrue =["Nein", "Ja"]
    @Berechtigung =["IT", "RW", "MV", "ZE", "OeA"]
    @Rollen = @@Rollen

    @Berechtigungen = @@Berechtigungen2.sort
    @BerechtigungsName = @@Berechtigungen

    @OZBPersonen ||= Array.new
    @Sonderberechtigungen = Sonderberechtigung.find(:all)

      @Sonderberechtigungen.each do |sonderberechtigung|
        @OZBPerson = OZBPerson.find(sonderberechtigung.Mnr)

SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Austrittsdatum` IS NULL
---
  def createSonderberechtigung
    @nil = nil
    @AktiveOzbPersonen = OZBPerson.find(:all, :conditions => {:Austrittsdatum => @nil})