ozbapp/app/controllers/veranstaltung_controller.rb

  def editVeranstaltungen
    if is_allowed(current_user, 7) then

      @Veranstaltungen = @@Veranstaltungen2.sort
      @VeranstaltungsName = @@Veranstaltungen
      @Veranstaltung = Veranstaltung.paginate(:page => params[:page], :per_page => 25)
      @Veranstaltungsarten = Veranstaltungsart.find(:all)
      @new_Veranstaltung = Veranstaltung.new
      @VeranstaltungenUndArt = Array.new
      @edit = false

      @Veranstaltung.each do |v|
        veranstaltungsart = Veranstaltungsart.find(v.VANr)
---
SELECT `veranstaltung`.* FROM `veranstaltung` LIMIT 25 OFFSET 0
SELECT `veranstaltungsart`.* FROM `veranstaltungsart` WHERE `veranstaltungsart`.`VANr` = 1 LIMIT 1