ozbapp/app/controllers/verwaltung_controller.rb

SELECT COUNT(*) FROM `ozbperson` INNER JOIN `person` ON `person`.`Pnr` = `ozbperson`.`Mnr` WHERE (GueltigBis LIKE '%9999%')
SELECT `ozbperson`.* FROM `ozbperson` INNER JOIN `person` ON `person`.`Pnr` = `ozbperson`.`Mnr` WHERE (GueltigBis LIKE '%9999%') ORDER BY austrittsdatum asc LIMIT 25 OFFSET 0
---
  def listOZBPersonen
    @OZBPersonen = OZBPerson.joins(:Person).order(sort_column + " " + sort_direction).paginate(:page => params[:page], :per_page => 25)

SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `adresse`.* FROM `adresse` WHERE `adresse`.`Pnr` = 96 AND (GueltigVon <= '2013-03-18 14:46:48') AND (GueltigBis > '2013-03-18 14:46:48') LIMIT 1
SELECT `person`.* FROM `person` WHERE `person`.`Pnr` = 96 AND (GueltigVon <= '2013-03-18 14:46:48') AND (GueltigBis > '2013-03-18 14:46:48') LIMIT 1
SELECT `telefon`.* FROM `telefon` WHERE `telefon`.`Pnr` = 96 AND `telefon`.`TelefonTyp` = 'tel'
SELECT `gesellschafter`.* FROM `gesellschafter` WHERE `gesellschafter`.`Mnr` = 96 AND (GueltigVon <= '2013-03-18 14:46:48') AND (GueltigBis > '2013-03-18 14:46:48') LIMIT 1
---
  def detailsOZBPerson
    @OZBPerson = OZBPerson.find(params[:Mnr])
    @Person    = Person.get(@OZBPerson.Mnr)
    @Adresse   = Adresse.get(@Person.Pnr)

    @Telefon   = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "tel"})
    @Fax       = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "fax"})
    @Mobil     = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "mob"})

    @Tel       = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr}, :order => "LfdNr ASC")

    @Rollen    = @@Rollen
    @Rollen2   = @@Rollen2
    case @Person.Rolle
    when "M"
      @Mitglied = Mitglied.get(@OZBPerson.Mnr)
    when "F"
      @Foerdermitglied = Foerdermitglied.get(@Person.Pnr)
    when "P"
      @Partner = Partner.get(@OZBPerson.Mnr)
      #if !@Partner.nil? then
      #  @PartnerPerson = Person.get(@Partner.Pnr_P)
      #end
    when "G"
      @Gesellschafter = Gesellschafter.get(@OZBPerson.Mnr)

SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
---
  def editPersonaldaten
    @OZBPerson = OZBPerson.find(params[:Mnr])

SELECT `ozbperson`.* FROM `ozbperson` WHERE `ozbperson`.`Mnr` = 13 LIMIT 1
SELECT `adresse`.* FROM `adresse` WHERE `adresse`.`Pnr` = 96 AND (GueltigVon <= '2013-03-18 14:47:01') AND (GueltigBis > '2013-03-18 14:47:01') LIMIT 1
SELECT `person`.* FROM `person` WHERE `person`.`Pnr` = 96 AND (GueltigVon <= '2013-03-18 14:47:01') AND (GueltigBis > '2013-03-18 14:47:01') LIMIT 1
SELECT `telefon`.* FROM `telefon` WHERE `telefon`.`Pnr` = 96 AND `telefon`.`TelefonTyp` = 'tel'
---
  def editKontaktdaten
    @OZBPerson = OZBPerson.find(params[:Mnr])
    @Person    = Person.get(@OZBPerson.Mnr)
    @Fullname  = @Person.Name + ", " + @Person.Vorname
    @Adresse   = Adresse.get(@Person.Pnr)
    @Telefon   = Telefon.find(:all, :conditions => {:Pnr => @Person.Pnr, :TelefonTyp => "tel"})

SELECT `sonderberechtigung`.* FROM `sonderberechtigung` WHERE `sonderberechtigung`.`ID` = 1 LIMIT 1
DELETE FROM `sonderberechtigung` WHERE `sonderberechtigung`.`ID` = 1
---
  def deleteBerechtigung
    @Sonderberechtigung = Sonderberechtigung.find(params[:id])
    @Sonderberechtigung.delete