ozbapp/app/controllers/webimport_controller.rb

                  # wenn Storno-Buchung lösche die entsprechende Buchung aus DB
                  kontonummer = sollkontonummer.to_i

                  b = Buchung.find(
                    :all,
                    :conditions =>
                    {
                      :BnKreis    => belegnummernkreis,
                      :BelegNr    => belegnummer,
                      :Belegdatum => buchungsdatum,
                      :KtoNr      => kontonummer
                    }
                  )
---
SELECT `buchung`.* FROM `buchung` WHERE `buchung`.`KtoNr` = 70013 ORDER BY Belegdatum ASC, Typ DESC, Habenbetrag DESC, Sollbetrag DESC, PSaldoAcc DESC

          end

          # das End-Saldo ins Konto eintragen
          konto = OzbKonto.find(:all, :conditions => { :KtoNr => ktoNr }).first
---
SELECT `ozbkonto`.* FROM `ozbkonto` WHERE (KtoNr = 70013 AND GueltigVon <= '2013-04-21 15:56:04' AND GueltigBis > '2013-04-21 15:56:04') ORDER BY ozbkonto.KtoNr DESC, ozbkonto.GueltigVon DESC LIMIT 1