ozbapp/app/controllers/willkommen_controller.rb

  def index

  	# If user admin, check if referer is given and redirect to manage page
  	if !request.referer.nil?

		if (URI(request.referer).path == ('/OZBPerson/Anmeldung') && isCurrentUserAdmin)
			redirect_to '/Verwaltung/Mitglieder'
		end

		if (URI(request.referer).path == ('/OZBPerson/edit') && isCurrentUserAdmin)
			redirect_to '/Verwaltung/Mitglieder'
		end

	end

    @current_person = Person.find(:last, :conditions => [ "Pnr = ?", current_OZBPerson.Mnr])
---
SELECT `person`.* FROM `person` WHERE (Pnr = 13) ORDER BY person.Pnr DESC, person.GueltigVon DESC LIMIT 1