ozbapp/app/views/sonderberechtigung/editRollen.html.erb

                <% @Berechtigung.each do |b|%>
                  <% @Sonderberechtigung = Sonderberechtigung.find(:all, :conditions =>{:Mnr => ozbPerson.Mnr, :Berechtigung => b })%>
---
SELECT `sonderberechtigung`.* FROM `sonderberechtigung` WHERE `sonderberechtigung`.`Mnr` = 13 AND `sonderberechtigung`.`Berechtigung` = 'IT'